Revit 2026 API

# LeaderShape Enumeration

---

Supported geometric shapes of annotation leaders.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LeaderShape
```
```vb
Public Enumeration LeaderShape
```
```cpp
public enum class LeaderShape
```
```fsharp
type LeaderShape
```

| Member name | Value | Description |
| --- | --- | --- |
| Arc | 2 | An arc between between the end point and anchor point. In this shape the elbow point controls the arc's radius. |
| Kinked | 1 | A kinked line with a shoulder defined by an elbow point. |
| Straight | 0 | A single straight line between the end point and anchor point. |

Although the Leader class supports all available shapes, not all types of leaders may have the option to change its shape. For example, leaders of text annotations can be of any shape, while leaders of level lines are never curved.

#### Reference

Autodesk.Revit.DB Namespace